CS/MachineLearning.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Machine Learning</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Machine Learning"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-07-22T22:01+0800"/>
<meta name="author" content="ChrisChen"/>
<meta name="description" content=""/>
<meta name="keywords" content="Machine Learning"/>
<link rel="stylesheet" href="../css/stylesheet.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>


<div id="content">
<h1 class="title">Machine Learning</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Definition</a></li>
<li><a href="#sec-2">2 Linear Regression</a>
<ul>
<li><a href="#sec-2-1">2.1 Gradient Descent</a></li>
<li><a href="#sec-2-2">2.2 Normal Equation</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Logistic Regression</a></li>
<li><a href="#sec-4">4 Regularization</a></li>
<li><a href="#sec-5">5 Octave Usage</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Definition</h2>
<div class="outline-text-2" id="text-1">


<p class="verse">
A computer program is said to learn from experience <i>E</i><br/>
with respect to some task <i>T</i> and some performance measure <i>P</i> ,<br/>
if its performance on <i>T</i> , as measured by P, improves with <br/>
experience E.<br/>
</p>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Linear Regression</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Hypothesis
  $$h_\theta(x)=\theta^T x$$

</li>
<li>Cost Function
  $$J(\theta) = \frac{1}{2m}\sum_{i=1}^m(h_\theta(x^{(i)})-y^{(i)})^2$$

</li>
<li>Goal
  $$minimize J(\theta_0, \theta_1)$$
</li>
</ul>



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Gradient Descent</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Outline</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>Start with some \(\theta\)
</li>
<li>Keep changing \(\theta\) to reduce \(J(\theta)\), until we hopefully end up at minimum
</li>
</ul>


</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Algorithm</h4>
<div class="outline-text-4" id="text-2-1-2">


<p class="verse">
repeat until convergence {<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; $$\theta_j := \theta_j - \alpha\frac{\partial}{\partial \theta_j}J(\theta)$$<br/>
}<br/>
\(\alpha\) is called learning rate. <br/>
After derivative,<br/>
$$\theta_j := \theta_j - \alpha\frac{1}{m}\sum_{i=1}^m(h_\theta(x^{(i)})-y^{(i)})x_j^{(i)}$$
simultaneously updata \(\theta_j\) for all j<br/>
</p>


<ul>
<li id="sec-2-1-2-1">Simultaneous updata:<br/>
$$temp0 := \theta_0 - \alpha\frac{\partial}{\partial \theta_0}J(\theta_0, \theta_1)$$
$$temp1 := \theta_1 - \alpha\frac{\partial}{\partial \theta_1}J(\theta_0, \theta_1)$$
$$\theta_0 := temp0$$
$$\theta_1 := temp1$$

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Normal Equation</h3>
<div class="outline-text-3" id="text-2-2">


$$\theta = (X^TX)^{-1}X^Ty$$

</div>

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Inverse in Octave</h4>
<div class="outline-text-4" id="text-2-2-1">


<p class="verse">
pinv vs. inv<br/>
pinv is a pseudo-inverse, always make correct result even the matrix is non-invertable.<br/>
</p>


<ul>
<li>Why non-invertable?
<ul>
<li>Redundant features(linearly dependant).
</li>
<li>Too many features

<p class="verse">
Delete some features, or use <a href="#sec-4">regularization</a><br/>
</p>


</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> vs. Gradient Descent</h4>
<div class="outline-text-4" id="text-2-2-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Gradient Descent</th><th scope="col" class="left">Normal Equation</th></tr>
</thead>
<tbody>
<tr><td class="left">Need to choose \(\alpha\)</td><td class="left">No need to choose \(\alpha\)</td></tr>
<tr><td class="left">Needs more iterations</td><td class="left">Don't need to iterate</td></tr>
<tr><td class="left">Works well with many features</td><td class="left">n features, \((X^TX)^{-1}\), takes \(O(n^3)\)</td></tr>
</tbody>
</table>

Number of features n &gt; 10000, use gradient descent.


</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Logistic Regression</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>Hypothesis
  $$h_\theta(x)=g(\theta^T x) = \frac{1}{1+e^{-\theta^T x}}$$
  Note that, funtion g(x) is called logistic function or sigmoid function.
</li>
</ul>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><a name="regularization" id="regularization"></a><span class="section-number-2">4</span> Regularization</h2>
<div class="outline-text-2" id="text-4">


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Octave Usage</h2>
<div class="outline-text-2" id="text-5">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Function</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">eye()</td><td class="left">identity matrix</td></tr>
<tr><td class="left">plot()</td><td class="left">generate graph</td></tr>
</tbody>
</table>

</div>
</div>
</div>

</body>
</html>
